---
kind: method
id: M:Autodesk.Revit.DB.Analysis.MEPAnalyticalModelData.Dispose
source: html/ed2266e1-f95c-0be1-7546-4d8c43790c26.htm
---
# Autodesk.Revit.DB.Analysis.MEPAnalyticalModelData.Dispose Method

Releases all resources used by the MEPAnalyticalModelData

## Syntax (C#)
```csharp
public void Dispose()
```